# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2, 1]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3Libra, [256]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3Libra, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3Libra, [512]]
  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32
  - [-1, 3, C3Libra, [512]] #8

# YOLO26n head
head:
  - [-1, 1, Conv, [256, 1, 1]] #9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3Libra, [512, False]] # 12
  - [-1, 1, Conv, [256, 1, 1]] #13
  - [-1, 1, Conv, [256, 3, 1]] #14
  - [[-1, -2], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3Libra, [512, False]] # 16 (P4/16-medium)
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3Libra, [512, False]] # 19 (P5/32-large)
  - [[16, 19], 1, Detect, [nc]] # Detect(P3, P4, P5)